# Creating Series

In [3]:
# Program for creating Series using series() method of Pandas Library

In [1]:
#Import Pandas library
import pandas as pd

In [2]:
#Creating Student Name List
Name=["Ashish","Sagar","Shrikant","Lovly","Saurabh"]
Name

['Ashish', 'Sagar', 'Shrikant', 'Lovly', 'Saurabh']

In [3]:
#Creating a Series 
Roll_list=pd.Series(Name,index=[1,2,3,4,5])
print(Roll_list)

1      Ashish
2       Sagar
3    Shrikant
4       Lovly
5     Saurabh
dtype: object

# Creating Data Frame

In [6]:
#Import Pandas library
import pandas as pd

In [8]:
#Creating Data Frame
df=pd.DataFrame([[10,12,14,16],[11,18,15,21],[12,13,14,15]],
columns= ["BIA","DBMS","DSS","CAO"])

In [9]:
df

   BIA  DBMS  DSS  CAO
0   10    12   14   16
1   11    18   15   21
2   12    13   14   15

In [10]:
df.shape

(3, 4)

In [11]:
df.size

12

In [12]:
df.ndim

2

# Adding Record (Row) to the data frame

In [21]:
df2=pd.DataFrame([[5,6,7,8]],
columns= ["BIA","DBMS","DSS","CAO"])

In [22]:
df3=df.concat(df2,ignore_index=True)

AttributeError: 'DataFrame' object has no attribute 'concat'

In [19]:
df3

NameError: name 'df3' is not defined

# Adding Attribute (Columns) name DM

In [84]:
df3["DM"]=[12,15,16,14]

In [85]:
df3

   CD  DBMS  DSS  CAO  DM
0  10    12   14   16  12
1  11    18   15   21  15
2  12    13   14   15  16
3   5     6    7    8  14

# Deleting Record from  df3 dataframe

In [89]:
df4=df3.drop(index=[1])

In [90]:
df4

   CD  DBMS  DSS  CAO  DM
0  10    12   14   16  12
2  12    13   14   15  16
3   5     6    7    8  14

# Deleting Attribute (Columns) from df3 dataframe

In [91]:
df5=df3.drop(columns=["DM"])

In [92]:
df5

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  12    13   14   15
3   5     6    7    8

In [94]:
#Finding mean of DSS 

print("Mean of DSS:", df5["DSS"].mean())

Mean of DSS: 12.5

In [97]:
#Finding median of DSS

print("Median of DSS:", df5["DSS"].median())

Median of DSS: 14.0

In [98]:
#Finding mode of DSS

print("Mode of DSS:", df5["DSS"].mode())

Mode of DSS: 0    14
dtype: int64

In [99]:
#Finding max number of DSS

print("Max of DSS:", df5["DSS"].max())

Max of DSS: 15

In [100]:
#Finding Min number of DSS

print("Max of DSS:", df5["DSS"].min())

Max of DSS: 7